src/cfe/osn/InformationRegisters/_РегламентныеЗадачиРасширения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>_РегламентныеЗадачиРасширения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Использование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РегламентноеЗадание</Name>
					<Type>
						<v8:Type>cfg:EnumRef._РегламентныеЗаданияРасширения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/osn/InformationRegisters/_РегламентныеЗадачиРасширения/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для каждого Запись ИЗ ЭтотОбъект Цикл
		
		Задание = РегламентныеЗаданияСервер.Задание(Запись.Идентификатор);
		
		Если Задание = Неопределено Тогда // Не найдено
				
			// Создать и зарегистрировать.
			ПараметрыЗадания = Новый Структура;
			ПараметрыЗадания.Вставить("Метаданные", Метаданные.РегламентныеЗадания.ЗапускДополнительныхОбработок);
			ПараметрыЗадания.Вставить("Использование", Запись.Использование);
			ПараметрыЗадания.Вставить("Наименование", Запись.РегламентноеЗадание);
			ПараметрыЗадания.Вставить("Ключ", Запись.Идентификатор);
			МассивПараметров = Новый Массив;
			МассивПараметров.Добавить(Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка());
			МассивПараметров.Добавить(Запись.РегламентноеЗадание);
			ПараметрыЗадания.Вставить("Параметры", МассивПараметров);
			ПараметрыЗадания.Вставить("Расписание", Запись.Расписание.Получить());
			Задание = РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
			
			Запись.Идентификатор = Задание.УникальныйИдентификатор;
			
		Иначе
			
			ПараметрыЗадания = Новый Структура;
			ПараметрыЗадания.Вставить("Метаданные", Метаданные.РегламентныеЗадания.ЗапускДополнительныхОбработок);
			ПараметрыЗадания.Вставить("Использование", Запись.Использование);
			ПараметрыЗадания.Вставить("Наименование", Запись.РегламентноеЗадание);
			ПараметрыЗадания.Вставить("Ключ", Запись.Идентификатор);
			МассивПараметров = Новый Массив;
			МассивПараметров.Добавить(Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка());
			МассивПараметров.Добавить(Запись.РегламентноеЗадание);
			ПараметрыЗадания.Вставить("Параметры", МассивПараметров);
			ПараметрыЗадания.Вставить("Расписание", Запись.Расписание.Получить());
		
			РегламентныеЗаданияСервер.ИзменитьЗадание(Запись.Идентификатор, ПараметрыЗадания);  
			
		КонецЕсли;			
		
	КонецЦикла;

	Если НЕ ЗначениеЗаполнено(ЭтотОбъект) И Модифицированность() Тогда
		
		Запись = РегистрыСведений._РегламентныеЗадачиРасширения.СоздатьМенеджерЗаписи();
		Запись.РегламентноеЗадание = ЭтотОбъект.Отбор.РегламентноеЗадание.Значение; //ЭтотОбъект.Отбор.РегламентноеЗадание;
		Запись.Прочитать();	
		
		РегламентныеЗаданияСервер.УдалитьЗадание(Запись.Идентификатор);	
				
	КонецЕсли;	
	
КонецПроцедуры
